content/euler/44.md
+++
title = "Project Euler 44: Pentagonal Numbers"
author = ["Gautam Manohar"]
description = "My solution to problem 44 of Project Euler."
date = 2018-07-16
tags = ["brute-force"]
categories = ["euler"]
draft = false
+++

## Problem Statement {#problem-statement}

Pentagonal numbers are given by the formula

\begin{equation\*}
P\_n = \frac{n(3n-1)}{2}.
\end{equation\*}

The first ten pentagonal numbers are

\begin{equation}
1,5,12,22,35,51,70,92,117,145,\ldots
\end{equation}

It can be seen that \\(P\_4 + P\_7 = 22 + 70 = 92 = P\_8\\). Also, \\(P\_7 - P\_5 = 70 - 35
= 35 = P\_5\\) is also pentagonal. Generalizing for a given \\(k\\), find all \\(P\_n\\),
where \\(n < N\\), such that at least one of \\(P\_n \pm P\_{n-k}\\) is pentagonal.


## My Algorithm {#my-algorithm}

Using the formula for \\(P\_n\\), we find a formula for its inverse:

\begin{equation}
\begin{split}
2P\_n &= 3n^2 - n \\\\\\
n &= \frac{1 \pm \sqrt{1 + 4\cdot3\cdot2P\_n}}{6}.
\end{split}
\end{equation}

Because \\(n\\) must be positive, we have that \\(x\\) is a pentagonal number if and
only if

\begin{equation}
\frac{1 + \sqrt{24x + 1}}{6}
\end{equation}

is an integer. From here we use a brute force approach. For each \\(K < n < N\\),
test whether one of \\(P\_n \pm P\_{n-k}\\) is pentagonal. This solution has time
complexity \\(O(N - K)\\).


### Project Euler {#project-euler}

The Project Euler version of this problem is more involved. We must instead find
the first \\(P\_n\\) such that both \\(P\_n - P\_{n-k}\\) and \\(P\_n + P\_{n-k}\\) are
pentagonal. To do this, we check all \\(k < n\\) for each \\(n\\) until we find the
answer. I used the following code, along with the same `pent` and `is_pent`
functions as in the HackerRank solution:

{{< highlight python "linenos=table, linenostart=1" >}}
n = 0
while True:
    n += 1
    a = pent(n)
    for k in range(1,n):
        b = pent(n-k)
        if pent(a-b) and pent(a+b):
            print(a-b)
            break
{{< /highlight >}}